app/Controllers/Home.php

    public function add()
    {
        $model = new EmployeeModel();
        if ($this->request->getMethod() == "post" && $this->validate([
            "full_name" => "required",
            "email" => "required"
        ])) {
            $save = $model->save([
                "full_name" => $this->request->getPost("full_name"),
                "email" => $this->request->getPost("email"),
                "mobile" => $this->request->getPost("mobile"),
                "department" => $this->request->getPost("department"),
                "salary" => $this->request->getPost("salary"),
                "doj" => $this->request->getPost("doj"),
                "dor" => $this->request->getPost("dor"),
                "is_active" => $this->request->getPost("is_active")
            ]);
---
INSERT INTO `employees` (`full_name`, `email`, `mobile`, `department`, `salary`, `doj`, `dor`, `is_active`) VALUES ('david', 'david101@getfundedafrica.com', '12345678', 'test department', '4321', '2023-02-05', '2023-02-12', NULL)