app/Models/EmployeeModel.php

SELECT *
FROM `employees`
---
    public function getAll(){
        return $this->findAll();